installer/core/app/views/admin/layouts/_sidebar.html.haml

                                %li= link_to t("keppler.sidebar-menu.#{menu[key]['name'].parameterize}-submenu.#{submenu[name]['name'].parameterize}"), submenu[name]['url_path'], class: "treeview-menu-link #{'active current' if submenu[name]['url_path'].include?(controller_path)}", 'data-no-turbolink' => true
                              - elsif menu[key]['model'].casecmp('seo') && current_user.roles.first.action?(menu[key]['model'], name)
---
SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]